<?php
// ................................................................................
//Арифметические операторы:
// Сложение:
$a = 10;
$b = 5;

if (($a + $b) > 10) {
    echo "Сумма больше 10.";
} else {
    echo "Сумма 10 или меньше.";
}

// Вычитание:
$x = 15;
$y = 7;

if (($x - $y) == 8) {
    echo "Разность равна 8.";
} else {
    echo "Разность не равна 8.";
}

// Умножение:
$length = 4;
$width = 5;

if (($length * $width) == 20) {
    echo "Площадь равна 20.";
} else {
    echo "Площадь не равна 20.";
}

// Деление:
$total = 100;
$count = 4;

if (($total / $count) >= 25) {
    echo "Среднее значение 25 или больше.";
} else {
    echo "Среднее значение меньше 25.";
}

// ...................................................................................


// Логические операторы:
// Логическое "И" (AND):
$age = 20;
$isStudent = true;

if ($age >= 18 && $isStudent) {
    echo "Взрослый студент.";
} else {
    echo "Не подходит.";
}

// Логическое "ИЛИ" (OR):
$isWeekend = true;
$isHoliday = false;

if ($isWeekend || $isHoliday) {
    echo "Можно отдохнуть!";
} else {
    echo "Время работать.";
}

// Логическое "НЕ" (NOT):
$isRaining = false;

if (!$isRaining) {
    echo "Можно гулять.";
} else {
    echo "Лучше остаться дома.";
}
// ....................................................................................................

// Сравнительные операторы:
// Равенство (==):
$a = 10;
$b = 10;

if ($a == $b) {
    echo "a равно b.";
} else {
    echo "a не равно b.";
}
// Неравенство (!=):
$x = 5;
$y = 7;

if ($x != $y) {
    echo "x не равно y.";
} else {
    echo "x равно y.";
}
// Строгое равенство (===):
$num = '10';
$str = 10;

if ($num === $str) {
    echo "Строгое равенство: равны.";
} else {
    echo "Строгое равенство: не равны.";
}

// Строгое неравенство (!==):
$num = 5;
$str = '5';

if ($num !== $str) {
    echo "Строгое неравенство: не равны.";
} else {
    echo "Строгое неравенство: равны.";
}

// Больше (>) и меньше (<):
$a = 8;
$b = 6;

if ($a > $b) {
    echo "a больше b.";
} else {
    echo "a не больше b.";
}

// Больше или равно (>=) и меньше или равно (<=):
$value = 10;

if ($value >= 10) {
    echo "value больше или равно 10.";
} else {
    echo "value меньше 10.";
}
// ................................................................................................................................................


// Операторы присваивания:
$a = 10;
$a += 5; // $a теперь 15


